{
  "profile": {
    "name": "Mahdi",
    "lastname": "Mohammadpour",
    "workTitle": "front-end developer",
    "location": "Tehran, Iran",
    "about": "I started my professional path with a 3-month React.js internship that gave me solid foundations in frontend development. After transitioning to a full-time role, I expanded my expertise to Next.js for server-side rendered applications, implemented efficient state management using Redux Toolkit, and optimized data fetching with RTK Query. I have hands-on experience deploying applications with Liara and collaborating through Git version control. Continuously learning, I'm currently working with TypeScript and Materail UI to build robust and maintainable solutions."
  },
  "buttons": {
    "contact": "Contact Me",
    "portfolio": "Portfolio",
    "skills": "Skills",
    "experiences": "Experiences",
    "downloadCv": "Download CV"
  },
    "messages": {
    "offlineError": "You are offline. Some features may not be available!"
  },
  "experiences": {"items":[
    {
      "company": "Basynergy",
      "url": "https://basynergy.ir/",
      "position": "Frontend Developer",
      "start": "June 2023",
      "end": "Until now",
      "description": "As a Front-End Developer at Basynergy (Tehran, Iran), I have over two years of experience in developing modern and user-friendly web applications using React and Next.js. I have designed responsive and optimized user interfaces with tools such as Redux Toolkit, RTK Query, TypeScript, Material UI, and Tailwind CSS. I am skilled in deploying projects with Liara and managing versions using GitHub and GitLab. I have collaborated in Agile teams, and my achievements include improving page load speed, optimizing performance, and enhancing user satisfaction.",
      "type": "full time"
    },
    {
      "company": "Iraniancyber",
      "url": "https://www.iraniancyber.com/",
      "position": "Programming tutor",
      "start": "Sep 2022",
      "end": "May 2024",
      "description": "Online programming instruction for children and teenagers, focusing on fundamental coding concepts, algorithms, and problem-solving. Designing interactive educational courses to enhance student motivation and effective learning.",
      "type": "part time"
    }
  ]},
  "portfolios": {
    "items": [
      {
        "name": "Basynergy",
        "url": "https://basynergy.ir/",
        "description": "Basynergy company introduction website and user panel",
        "type": "person"
      },
      {
        "name": "learnito",
        "url": "",
        "description": "Programming learning platform (Bachelor's project)",
        "type": "person"
      },
      {
        "name": "IMPCargo",
        "url": "",
        "description": "User panel",
        "type": "person"
      },
      {
        "name": "Healport",
        "url": "https://healport.io/",
        "description": "User panel and admin panel",
        "type": "person"
      },
      {
        "name": "App 12",
        "url": "https://web.12application.ir/",
        "description": "Admin panel and web application",
        "type": "team"
      }
    ]
  }
}
